Tekla Open API Reference for Tekla Structures 2025
WpfReinforcementCatalog Properties
The WpfReinforcementCatalog type exposes the following members.
Properties
Name | Description
ButtonHeight
 Gets and sets the height of the button control.
ButtonText
 Gets and sets the text of the button control.
ButtonWidth
 Gets and sets the width of the button control.
SelectedRebarBendingRadius
 Gets the selected rebar bending radius in the control.
SelectedRebarGrade
 Gets the selected rebar grade in the control.
SelectedRebarSize
 Gets the selected rebar size in the control.
SelectedUsage
 Gets the selected rebar usage in the control.
Top
See Also
Reference
WpfReinforcementCatalog Class
Tekla.Structures.Dialog.UIControls Namespace